#include <stdio.h>
void print_number_in_words(int num) {
    char *hundreds[] = {"", "сто", "двісті", "триста", "чотириста", "п'ятсот", "шістсот", "сімсот", "вісімсот", "дев'ятсот"};
    char *tens[] = {"", "", "двадцять", "тридцять", "сорок", "п'ятдесят", "шістдесят", "сімдесят", "ісімдесят", "дев'яносто"};
    char *teens[] = {"десять", "одинадцять", "дванадцять", "тринадцять", "чотирнадцять", "п'ятнадцять", "шістнадцять", "сімнадцять", "вісімнадцять", "дев'ятнадцять"};
    char *ones[] = {"", "один", "два", "три", "чотири", "п'ять", "шість", "сім", "вісім", "дев'ять"};
    int h = num / 100;
    int t = (num % 100) / 10;
    int o = num % 10;
    printf("%s ", hundreds[h]);
    if (t == 1) {
        printf("%s\n", teens[o]);
    } else {
        printf("%s %s\n", tens[t], ones[o]);
    }
}
int main() {
    int num;
    printf("Введіть тризначне число: ");
    scanf("%d", &num);
    if (num < 100 || num > 999) {
        printf("Будь ласка, введіть тризначне число.\n");
    } else {
        print_number_in_words(num);
    }
    return 0;
}
